["Rob Schneider is a famous comedian cause of his movements, facials and performances of \\not humans\\\". This time he is The Animal. Marvin is a loser who is trying to be a hero and one day, nobody takes a call from a man that gets attacked, so Marvin has to take this case and save the attacked man. But on his way to the crime scene, he crashes with his car and gets really damaged. He doesn't remember what happens and at the next ordinary day, his life is not same when he finds out that he has animal instincts. Of course, we got our female that our main character is trying to reach but his tryings, are useless. She is played by Collen Haskell. There are no negative characters. The negative character, is destiny if I could use this metaphor. Marvin should find out, how to become a normal human being again. By the way-his animal instincts, helps him in some situations. Schneider's performance is a so-so. The movie is so unreal that gets stupid at some moments but it is one of those movies, called mindless fun as I have written above. So watch it for the monkey style Rob Schneider but it is definitely not one of the best comedies ever or one of the best movies that Schneider appears in. He is a great comedian but this is not his best movie.\"", "This movie was Hilarious! It occasionally went too far, but isn't that what we expect from them? The theater roared with laughter and ooooooed at all the incredibly crazy stunts. It's rude, crude, and occasionally frighteningly intense. The whole gang is back and even more out of their minds, which in turn provides for some great entertainment. I don't want to give anything away, but the little snippets of clips going around the net are nothing compared to what comes after. <br /><br />This is a great movie to go see with friends. Try to see it with a big crowd. You will not be disappointed. Just don't go with anyone who can't take it (see above). It will not go over well, you can be sure of that. But that's pretty obvious in the first place. If you enjoyed the first one, you will loooooove this one.", "This is an entertaining \\history\\\" of the FBI, but it should be viewed as fiction, because that's exactly what it is. What else could it be when J. Edgar Hoover personally approved and had a cameo role in the production. James Stewart is excellent, as usual, and the supporting cast, except for the talentless Vera Miles, is good. Murray Hamilton is especially good in a supporting role as Stewart's partner and best friend. The FBI accomplishments that the film highlights are undoubtedly all true. What is significant is what it leaves out.<br /><br />One of the most shameful parts of the film is the depiction of the killing of John Dillinger. It is portrayed pretty much as it happened, but no mention at all is made of Melvin Purvis, the Chicago Bureau Chief who headed the operation. Instead, the operation is depicted as if the fictional Chip Hardesty were running it. It has been said that Hoover was jealous of the publicity that Purvis received after Dillinger was killed; Purvis was subsequently transferred to a remote outpost, and shortly afterward left the FBI. This is no doubt why Purvis was never mentioned in the film. But this viewer, at least, paused to think that if Purvis was treated this way, what about all the agents who conducted all the other operations depicted in the film. Were they also completely ignored and replaced by the fictional Hardesty.<br /><br />The film is probably accurate in its portrayal of FBI activity up through the end of WWII. However, after that point, the film would have us believe that the only threat facing the US came from international communism, which is no doubt what Hoover believed. Never mind the Mafia. Never mind the lynchings that were still going on in the South. Never mind that blacks were being intimidated to keep them from voting in much of the South. I don't know if the FBI had started wiretapping Martin Luther King by the time this film was made, but if not, it wasn't very long afterward that it started.<br /><br />As I said at the outset, this is pretty good entertainment, but it should be viewed as the sanitized fictionalization that it is.\"", "Two hard-luck but crafty ladies decide to act like HAVANA WIDOWS by sailing to Cuba to meet & blackmail rich gentlemen...<br /><br />This was the sort of ephemeral comic frippery which the studios produced quite effortlessly during the 1930's. Well made & highly enjoyable, Depression audiences couldn't seem to get enough of these popular, funny photo dramas.<br /><br />Joan Blondell & Glenda Farrell are perfectly cast as the frantic, fast-talking females who will go to great lengths to make a little dishonest dough. Although Joan gets both top billing and the romantic scenes, both gals are as talented & watchable as they are gorgeous.<br /><br />Handsome Lyle Talbot plays Joan's persistent suitor, but he's given relatively little to do. Chubby, cherubic Guy Kibbee appears as the girls' intended target. Whether awakening to find himself in the wrong bed or being chased across the roof of a Cuban hacienda in his long johns, he is equally hilarious. Behind him comes a rank of character actors - Allen Jenkins, Frank McHugh, Ruth Donnelly, Hobart Cavanaugh, Maude Eburne, Dewey Robinson - all equally adept at pleasing the toughest crowd.<br /><br />Movie mavens will recognize an uncredited James Murray as the suspicious bank teller with the forged check. This very talented actor was pulled out of complete obscurity to star in King Vidor's THE CROWD (1928), one of the silent era's most prestigious films. Hopes were high for a great career, but his celebrity faded quickly with sound pictures. After a long string of tiny roles & bit parts, broke & destitute, his life ended in the waters of a New York river in 1936. He was only 35 years old.<br /><br />While never stars of the first rank, Joan Blondell (1906-1979) & Glenda Farrell (1904-1971) enlivened scores of films at Warner Bros. throughout the 1930's, especially the eight in which they appeared together. Whether playing gold diggers or working girls, reporters or secretaries, these blonde & brassy ladies were very nearly always a match for whatever leading man was lucky enough to share equal billing alongside them. With a wisecrack or a glance, their characters showed they were ready to take on the world - and any man in it. Never as wickedly brazen as Paramount's Mae West, you always had the feeling that, tough as they were, Blondell & Farrell used their toughness to defend vulnerable hearts ready to break over the right guy. While many performances from seven decades ago can look campy or contrived today, these two lovely ladies are still spirited & sassy.", "This was a sad waste of two such promising actors. Chris Klein's character was unlikable from the start and never made an improvement. What did she see in him?? He was rarely kind, never thankful for what he does have...and a coward. Pass this one by on the shelves. You'll be glad you did.", "OK, so I don't watch too many horror movies - and the reason is films like 'Dark Remains'. I caught this on (a surprisingly feature-filled) DVD and it scared me silly. In fact the only extra I think the DVD was missing was a pair of new pants.<br /><br />However, the next day I was telling someone about it when I realised I'd only really seen about 10% of it. The rest of the time I'd been watching the pizza on my coffee table - nervous that my girlfriend would catch me if I actually covered my eyes. The few times I DID brave watching the screen I jumped so hard that I decided not to look up again.<br /><br />The film-making is solid and the characters' situation was really compelling. The simplicity of the film is what really captured my jump-button - it's merely a woodland, a cabin and a disused jail - and a LOT of darkness. Most surprising to me was the fact that while this was clearly not a multi-million dollar production, the make-up effects really looked like it was! Also, it's obvious this is a film made by someone with a great love of film-making. The sound design and the music really made use of my surround system like many Hollywood movies have never done. I noticed on-line that this film won the LA Shriekfest - a really major achievement, and I guess that the festival had seen the filmmakers' clear talent - and probably a great deal more of this movie than I managed to.<br /><br />Turn up the sound, turn off the lights, and, if you want to keep your girlfriend - order a pizza.", "The movie was fantastic. If your a fan of Bams' cky videos, jackass, or his show Viva la Bam, you cant help but like it. I have a few friends who aren't fans that enjoyed it, and others who thought it wasn't that great. Those who didn't like it were mostly female friends, they really didn't appreciate some of the crude humor, that personally i think made the movie so funny. I'm pretty sure the entire movie was filmed in Bams home town, which includes a lot of his regularly visited locations. The cast of is made up of all his friends and cky buddies, and also includes some big name pro skateboarders too. The soundtrack is phenomenal, with music by HIM. In my opinion, Haggard has it all. A great plot, characters you'll never see anywhere else. Plenty of humor great music and a cast that was dedicated to the project.", "honestly, i loved Michael. although there were \\give me a pillow i need to take a nap\\\" parts, it was cool. i think everyone did a great job in this film. and nora ephron is in my \\\"ok\\\" list of directors.<br /><br />it's nice to see John Travolta as a pot-bellied angel. it's not very often i see one in a movie. some people might call this a boring movie, but for me i loved it. angels and all.\"", "The Unborn is a pretty good low-budget horror movie exploiting the fears associated with pregnancy. It's very well acted by the always-good Brooke Adams and b-movie stalwart James Karen, although the supporting cast is pretty average for a b-grader. The music, by Gary Numan of all people, is good too. Henry Dominic's script is quite intelligent for this sort of thing, although there is a hint of misogyny about it. Rodman Fender's direction is merely adequate, and there are some unnecessary cheap scares. If you're a fan of Adams, whose movie career is nowhere near as illustrious as it should be, check it out; she's great, as always.", "*Minor Spoiler* <br /><br />Inhabited isn't scary, but it is creepy. It is an interesting 'little' story with good acting and great special effects makeup.<br /><br />Basic plot: A little girl blames the strange things going on at her family's new house and accompanying playhouse on her faerie friends.<br /><br />The movie doesn't waste time getting moving, though the ending could have been more involved.<br /><br />I don't recommend this movie to those expecting/wanting hardcore horror, but I do recommend it to those who want a chiller and not necessarily a thriller."]