["Fantastically written, acted, and produced! Loved seeing this gleaming, talented cast -- every single one of them -- give a such great performance. This movie thoroughly warmed the cockles of my heart! Great storytelling!<br /><br />This is a great movie for Black History month. Full of an accurate portrayal of recent history and very real characters who weathered incredible pain -- with dignity and a belief in a better future. It is so easy to see how these diverse adults all affected this child and contributed to the fertile imagination that would eventually fuel the talent of his adulthood. The next time you're in the company of a listening and observing child, remember; show or he may be a writer-in-the-making!", "The Color Purple is a masterpiece. It displays the amazing acting abilities of Whoopi Goldberg, Oprah Winfrey, and Danny Glover. Not only is Steven Spielberg the most incredible director of all time but his versatility shines through in this film. If you ever want to see what a movie can do watch this. It's a beautiful portrayal of one of the most moving stories of all time!", "This documentary is such a wonderful example of what an entertaining and amazing experience a documentary can be, if done so well as this. The subject, Mark, is smart, funny and very driven, and this story of his personal fight to live his dreams will be inspiring to anyone who knows what it is like to harbor an \\impossible\\\" dream. See this mov\"", "I just saw The Drugs Years on VH1 and I love it. I think it reflects the drug history very well and most importantly IT HAS A STRONG MESSAGE TO THE ALL GENERATIONS. There is woodstock, there are Joplin's, Hendrix's and Jim Morrison's deaths, there are many many examples of drug use and drug abuse. It completely cover the time line and evolution of drug use in America in both good and bad ways. In my opinion this documentary is well done and I would like to congratulate to its creators because this is exactly what is needed to be playing in the TV in these days. I am waiting for the DVD release. You should definitely see it!!! This movie is stunning-- BIG TIME!", "I love this movie. I watched it over and over when i rented it from Netflix.It had a lot of substance and meaning for me. I think many people will enjoy it.I have read and seen quite a few lesbian stories over the years and am happy to say they are getting better and better in how they are presented.They tend to have a more positive feel for the life style and feeling's of gay women.Its nice to see two women find themselves and be as happy as others in this society.I think it is apparent that more and more movies with this theme will grace our theaters and TV screens.Many producers and directors are realizing that Lesbians live very full and wholesome lives and that we have wonderful stories that should and can be seen by individuals as well as families without hesitation.", "The film starts out with a narration of the protagonist explaining certain crimes occurring all over the city and then we get to know that the hero is a cop who is either suspended or has probably retired. I did not have the patience or the interest to verify the above before commenting. If there is a stereotype for narrators to have a deep, sleep-inducing voice then, it is high time to put an end to it. I seriously fell asleep and did not bother to shut the movie down either. Am still trying to figure out what the movie was all about and why there were no outdoor shootings. A third rate TV Serial will have more number of sets compared to this crap of a movie and I still pity the actors and producers involved in this huge bullshit of a movie. It ought to have been produced as a normal TV serial or maybe even as a local theater drama instead of putting it out on the big screen. Total waste of time and money. The movie was supposed to be in production for a long time and it would have been better to have left it that way.With redundant sleep inducing dialogs and sets, this is the worst movie I have come across.", "The clichéd Polynesian males drink, fight and make a stream of sexist, stupid and unfunny remarks. Real life Polynesians are much funnier than these stereotyped, cardboard characters. The supposedly Samoan girl didn't look or act Samoan at all, seemed more like the stock white female who has sex with anyone on a whim. With weak as water story lines you can't say anything about the acting - even the most brilliant actors could do nothing with this script. It's sad to see Polynesian actors willing to play such sad stereotypes in a film with not one good scene, and only two or three 'jokes'. What a waste of Kiwi taxpayers' money, what a lost opportunity to make a great film about a vibrant community. It's better not to make movies if they're as bad and mindless as this.", "Most book adaptations are bad but this film left out key parts of the storyline and changed the description and some characters. They rewired the storyline and combined scenes and changed the order. They added ridiculous things into it that never happened in the book and would never happen.<br /><br />If i hadn't read the book beforehand it would have been an incredibly dull film, it didn't make you care about the characters, like them or dislike them. It turns the characters into jokes.<br /><br />Awful.<br /><br />Ridiculous.<br /><br />Waste of two hours of my life.", "Olivia D'Abo in a wet T-shirt is the only thing this movie has going for it. Other than that, this Canadian production about a man taking out a vicious band of hillbillies is not worth anybody's time. The writing is bad, the acting is poor and the direction is sub-standard.", "This movie was such a waste of my money. it was disgusting as well as disturbing. honestly, i would never recommend this movie to anyone. who thinks of a movie where a girl blows her dog?? seriously... it was a waste of my time. i kept watching the movie, hoping it would get better and a plot would emerge but that never happened. i'd rate the movie an F-. This movie should have been rated R for its disturbing nature. I would never let children of any age see this movie. this movie sucks. this movie is horrible. this movie was a waste of my time. i could have spent the night doing some worth my time instead of renting this movie. this movie was a waste of gas money to get to the store and definitely a waste of two dollars to watch it. pretty much, no one should watch this movie. this movie should be banned and burned."]